# Essential terminal utilities
tap "homebrew/services"

brew "openssl"
brew "readline", link: true
brew "git"
brew "postgresql"
brew "redis"
brew "imagemagick"
brew "ssh-copy-id"
brew "heroku-toolbelt"
brew "tmux"
brew "vim"
brew "curl", args: ["with-openssl"]
brew "zsh"
brew "stow"
brew "gpg"
brew "dockutil"
brew "the_silver_searcher"

# Essential Mac apps
tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"

cask "java"
cask "skype"
cask "iterm2"
cask "the-unarchiver"
cask "firefox"
cask "slack"
cask "dbeaver-community"
cask "gpg-suite"
cask "font-hack"
cask "karabiner"

# Go development
brew "go"

# Ruby development
brew "rbenv"
brew "ruby-build"
brew "rbenv-default-gems"

# Node development
brew "nvm"


